backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  def authorize
    header = request.headers['Authorization']
    if header.present?
      token = header.split(' ').last
      begin
        decoded = JsonWebToken.decode(token)
        @current_user = User.find_by(id: decoded[:user_id])