backend/app/controllers/auth_controller.rb

  def register
    user = User.new(email: params[:email], password: params[:password])
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ('aman@gmail.com', '$2a$12$AzdIqtnlQl6VlgE/Xk9DZe0tLPeMEP9vQAW6q2KSiM1ORLD/FaU/y', '2025-07-31 15:36:53.580066', '2025-07-31 15:36:53.580066') RETURNING "id"