backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 5 ORDER BY "tasks"."created_at" DESC
---
  def index
    tasks = @current_user.tasks.order(created_at: :desc)

INSERT INTO "tasks" ("title", "status", "user_id", "created_at", "updated_at") VALUES ('Finish Vite + Rails integration', 'todo', 8, '2025-07-31 15:20:04.604661', '2025-07-31 15:20:04.604661') RETURNING "id"
---
    task = @current_user.tasks.build(task_params)
    if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 5 AND "tasks"."id" = 2 LIMIT 1
UPDATE "tasks" SET "status" = 'doing', "updated_at" = '2025-07-31 15:24:08.193804' WHERE "tasks"."id" = 2
---
    task = @current_user.tasks.find(params[:id])
    if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 5 AND "tasks"."id" = 2 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 2
---
  task = @current_user.tasks.find_by(id: params[:id])
  if task
    task.destroy